# Guided Project: Analysing CIA Factbook Data Using SQLite and Python

In [1]:
#Import pandas and sqlite
import pandas as pd
import sqlite3
conn = sqlite3.connect("factbook.db")

#Return info on the tables in the database
q = "SELECT * FROM sqlite_master WHERE type='table';"
pd.read_sql_query(q, conn)

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

In [2]:
# Viewing the first 5 rows of the facts db
q2 = "SELECT *FROM facts LIMIT 5"
pd.read_sql_query(q2,conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

## Summary Statistics

In [3]:
q3 = "select min(population) min_pop, max(population) max_pop, min(population_growth) min_pop_growth, max(population_growth) max_pop_growth FROM facts"
pd.read_sql_query(q3,conn)

   min_pop     max_pop  min_pop_growth  max_pop_growth
0        0  7256490011             0.0            4.02

## Outliers

In [4]:
q4 = "select * from facts where population = 0 or population = 7256490011"
pd.read_sql_query(q4, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,250,ay,Antarctica,None,280000.0,None,0,NaN,NaN,NaN,None
1,261,xx,World,None,NaN,None,7256490011,1.08,18.6,7.8,None

It can be assumed the the world population figure is an aggregate of the populations whilst Antarctia has either 0 permenant residents or no official census.